<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.GoogleChrome</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/chrome/mac/stable/GGRO/googlechrome.dmg</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/google</string>
		<key>NAME</key>
		<string>Google Chrome</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>developer</key>
			<string>Google</string>
			<key>description</key>
			<string>&lt;html&gt;&lt;p&gt;&lt;b&gt;Fast, Simple, and Secure Web Browser, Built for the Modern Web&lt;/b&gt;&lt;/p&gt;&lt;br&gt;&lt;p&gt;Chrome is designed to be fast in every possible way. Chrome's browser window is streamlined, clean and simple; and, it’s designed to keep you safer and more secure on the web with built-in malware and phishing protection, auto-updates to make sure you have all the latest security fixes, and more.&lt;/p&gt;&lt;br&gt;&lt;p&gt;Signing in to Chrome brings your bookmarks, history, and other settings to all your computers. It also automatically signs you in to all your favorite Google services.&lt;/p&gt;&lt;br&gt;&lt;br&gt;&lt;img src="https://raw.githubusercontent.com/chasetb/munki_artwork/master/GoogleChrome.png"&gt;&lt;/html&gt;</string>
			<key>display_name</key>
			<string>Google Chrome</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.google-chrome</string>
</dict>
</plist>
