<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest Outlook installer, downloads the disk image and extracts the pkg.
Set VERSION to a specific version number to download that version instead.
Set CULTURE_CODE to a different value to get a different localization. See
http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.</string>
    <key>Identifier</key>
    <string>com.github.arubdesu.munki.OutlookInstaller</string>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Outlook</string>
        <key>display_name</key>
        <string>Microsoft Outlook for Mac</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/MSOutlook</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
              <string>Microsoft Outlook</string>
              <string>Microsoft Error Reporting</string>
              <string>Microsoft Auto Update</string>
            </array>
            <key>developer</key>
            <string>Microsoft</string>
            <key>catalogs</key>
            <array>
                <string>Staging</string>
            </array>
            <key>minimum_os_version</key>
            <string>10.9.3</string>
            <key>update_for</key>
            <array>
                <string>Outlook</string>
            </array>
            <key>category</key>
            <string>Productivity</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MSOutlookURLandUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>culture_code</key>
                <string>%CULTURE_CODE%</string>
                <key>munki_update_name</key>
                <string>%NAME%</string>
                <key>version</key>
                <string>%VERSION%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Microsoft_Outlook.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Get version from the app bundle</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Microsoft Outlook.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Merge input pkginfo and additional_pkginfo generated by MSLyncURLandUpdateInfoProvider</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleIdentifier</key>
                            <string>com.microsoft.Outlook</string>
                            <key>CFBundleName</key>
                            <string>Outlook</string>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>CFBundleVersion</key>
                            <string>%version%</string>
                            <key>path</key>
                            <string>/Applications/Microsoft Outlook.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                    </array>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
